frontend/controllers/ProfileController.php

    public function actionCabinet(): string
    {
        $userId = Yii::$app->user->id;
        if ($userId === null) {
            throw new \yii\web\ForbiddenHttpException('Access denied.');
        }

        $user = User::find()
            ->with('userGroups')
            ->where(['id' => $userId])
            ->one();
---
SELECT * FROM `user` WHERE `id`=41

    public function actionUpdate()
    {
        $userId = Yii::$app->user->id;
        if ($userId === null) {
            throw new NotFoundHttpException('Bunday foydalanuvchi mavjud emas', '404');
        }
        $model = User::findOne($userId);

        if (!$model) {
            throw new NotFoundHttpException('Foydalanuvchi topilmadi', '404');
        }
        if ($this->request->isPost) {
            if ($model->load($this->request->post())) {
                $model->save();
---
SELECT * FROM `user` WHERE `id`=41
UPDATE `user` SET `updated_at`=1697526257, `first_name`='Sardor' WHERE `id`=41