frontend/controllers/TaskController.php

    public function actionIndex()
    {
        $model = Task::find()->all();
---
SELECT * FROM `task`