frontend/controllers/TheoryVirtualController.php

      public function actionIndex()
    {
        $query = TheoryVirtual::find();
        $count = $query->count();
---
SELECT COUNT(*) FROM `theory_virtual`