frontend/views/layouts/footer.php

SELECT * FROM `contact` WHERE `status`=1
---
use yii\helpers\Url;
use common\models\Contact;

$contact = Contact::find()
      ->where(['status' => 1])
      ->all()