backend/views/theory/index.php

$this->title = Yii::t('app', 'Nazariya');
$this->params['breadcrumbs'][] = $this->title;

$foto = Theory::find()->all();
---
SELECT * FROM `theory`