backend/views/contact/index.php

$this->title = Yii::t('app', 'Contact');
$this->params['breadcrumbs'][] = $this->title;

$foto = Contact::find()->all();
---
SELECT * FROM `contact`