backend/views/laboratory/index.php

SELECT * FROM `laboratory`
---
$this->title = Yii::t('app', 'Labaratoriya');
$this->params['breadcrumbs'][] = $this->title;

$foto = Laboratory::find()->all();