backend/views/form/index.php

SELECT * FROM `form`
---
use yii\helpers\Url;
use yii\helpers\Html;

$form = Form::find()->all();