frontend/views/site/_practica.php

SELECT * FROM `practica` WHERE `status`='1' ORDER BY `id` DESC LIMIT 3
---
use yii\helpers\Url;
use common\models\Practica;

$prac = Practica::find()
    ->where(['status' => '1'])
    ->orderBy(['id' => SORT_DESC])
    ->limit(3)
    ->all();