frontend/views/site/_school_start.php

SELECT * FROM `school_start` WHERE `status`='1'
---

use common\models\SchoolStart;

$school = SchoolStart::find()
  ->where(['status' => '1'])
    ->all();