frontend/views/site/_slider.php

use yii\helpers\Url;
use common\models\Slider;

$slider =  Slider::find()->where(['status' => 1])->all();
---
SELECT * FROM `slider` WHERE `status`=1