frontend/views/site/_yangiliklar.php

SELECT * FROM `nevs` WHERE `status`='1' ORDER BY `id` DESC LIMIT 5
---
use yii\helpers\Url;
use common\models\Nevs;

$AllNevs = Nevs::find()
    ->where(['status' => '1'])
    ->orderBy(['id' => SORT_DESC])
    ->limit(5)
    ->all();